<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>Installomator</key>
			<array>
				<dict>
					<key>DisplayName</key>
					<string>Firefox</string>
					<key>Icon</key>
					<string>ExampleIcon.png</string>
					<key>Label</key>
					<string>firefoxpkg</string>
				</dict>
				<dict>
					<key>DisplayName</key>
					<string>Microsoft Office 365</string>
					<key>Icon</key>
					<string>SF=doc.circle,color=blue</string>
					<key>Label</key>
					<string>microsoftoffice365</string>
				</dict>
				<dict>
					<key>DisplayName</key>
					<string>Zoom</string>
					<key>Icon</key>
					<string>SF= video.circle,color=blue</string>
					<key>Label</key>
					<string>zoom</string>
				</dict>
			</array>
			<key>Packages</key>
			<array>
				<dict>
					<key>DisplayName</key>
					<string>Mist v0.5</string>
					<key>Icon</key>
					<string>https://github.com/ninxsoft/Mist/blob/main/README%20Resources/App%20Icon.png?raw=true</string>
					<key>PackagePath</key>
					<string>https://github.com/ninxsoft/Mist/releases/download/v0.5/Mist.0.5.pkg</string>
					<key>TeamID</key>
					<string>7K3HVCLV7Z</string>
				</dict>
			</array>
			<key>PayloadDisplayName</key>
			<string>Baseline</string>
			<key>PayloadIdentifier</key>
			<string>com.secondsonconsulting.baseline.D031FEC3-06B0-497A-BC0A-5D24AE8E91AD</string>
			<key>PayloadType</key>
			<string>com.secondsonconsulting.baseline</string>
			<key>PayloadUUID</key>
			<string>75A6163E-E581-4E91-88B7-17927BF9667A</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Scripts</key>
			<array>
				<dict>
					<key>DisplayName</key>
					<string>Enabling Location Services</string>
					<key>Icon</key>
					<string>/System/Library/PrivateFrameworks/AOSUI.framework/Versions/A/Resources/findmy.icns</string>
					<key>MD5</key>
					<string>c32364f1f3f7fc2410e265d82095feee</string>
					<key>ScriptPath</key>
					<string>https://raw.githubusercontent.com/acodega/macos/main/enable_location-services.sh</string>
				</dict>
			</array>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Configuration file for Baseline.sh</string>
	<key>PayloadDisplayName</key>
	<string>Baseline Config</string>
	<key>PayloadIdentifier</key>
	<string>SecondSon.6F1AD41D-2069-4861-B72C-C5F0D44C9B99</string>
	<key>PayloadOrganization</key>
	<string>Second Son Consulting Inc.</string>
	<key>PayloadScope</key>
	<string>System</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>BEDFC054-5B20-430F-B388-A51C3B4D30AE</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
